old_price = "Art"
new_price = "Desing"

card = input("Введите карту товара: ")
new_card = card.replace(old_price, new_price)

print(new_card)

#Задание 3: Замена ключевых слов
#Описание:

#Роман хочет заменить слово "Art" на "Design" в различных описаниях карточек товаров своего магазина.