print("*")
print("**")
print("***")
print("****")
print("*****")

# Описание:

# Роман готовится к новому году! Он решил закупить для своего магазина новогодние ёлки, но ему нравится определённый тип ёлок. Он хочет отправить поставщикам письмо с изображением ёлки. Для автоматизации процесса он просит вас написать программу для принтера, которая будет выводить необходимую ёлку. Вот так она должна выглядеть

# “””

# *

# **

# ***

# ****

# *****

# “””

# Реализуйте программу, которая выводит представленную выше фигуру.