print ("Hello, world")

# Задача 1: “Привет, мир!”
# Реализуйте программу, которая выводит фразу “Привет, мир!”
# Как известно, программисты очень вежливые люди, а вежливость требует первым делом поздороваться!