a = str("Гладиолус")
print("Добрый день! Вы работаете в магазине:")
print(a)

#Описание:
# Роман решил открыть свой магазин, он просит вас помочь с программой для кассиров. Первым делом он хочет, чтобы пользователь получал приветственное сообщение в две строки. Приветствие выглядит так

# “””

# Добрый день! Вы работаете в магазине: 
# "Гладиолус"

# “””

# Роман пока не уверен над названием магазина, поэтому просит вас сохранить “Гладиолус” в переменную, чтобы он потом мог легко поменять название.

# Реализуйте программу, которая приветствует сотрудника выводя две строки текста, “Добрый день! Вы работаете в магазине:” и второй строкой “Гладиолус”. При этом, Вторая строка должна храниться в переменной.