products = [1, 14, 4, 8, 6, 9]
sum_products = sum(products)
print(sum_products)

#Задача 1: Открываем кассу
#Описание:

#Роман открывает свой первый магазин, но подрядчик не успел предоставить кассовую технику. 
#Роман уже смог записать покупки первого покупателя, но забыл как выводить сумму покупок. 
#Такой код он прислал нам

#Реализуйте программу, используя коллекцию products представленную выше и допишите код, чтобы программа выводила сумму чисел в этой коллекции.
#Таблица входных и выходных данных: