input_produst = input("Введите товары через запятую: ")
product_list = input_produst.split(",")

print(f"Товары с нечетными индексами: {product_list[1::2]}")

#Задание 1: Инвентаризация магазина Романа
#Описание:

#Роман хочет провести инвентаризацию в своем магазине. 
#Помогите ему написать программу, которая выводит каждый товар с нечетным индексом из списка товаров.