price_list = [50, 10, 60, 70, 20, 80, 30, 90, 40]

print(sorted(price_list, reverse = True))

#Задание 9: Сортировка товаров по цене 🔥
#Описание:

#Роман хочет отсортировать товары на полке по убыванию цен. 
#Программа должна выводить новый список цен в порядке убывания.