input_employees = input("Введите имена сотрудников:")
employees_list = input_employees.split(',')

print(f"Всего сотрудников: ", len(employees_list))

#Задание 4: Найм новых сотрудников
#Описание:

#Роман недавно нанял несколько новых сотрудников в свою дизайн-студию.
#Он хочет быстро узнать, сколько у него теперь сотрудников. 
#Помогите ему в этом.