number_1 = int(input("Введите первое число: "))
number_1 = int(input("Введите второе число: "))
number_1 = int(input("Введите третье число: "))

arefmetic_mean = (number_1 + number_2 + number_3) / 3

print(f"Среднее арифметическое этих 3 чисел: {arefmetic_mean}")

#Задача 2: Среднее арифметическое
#Описание:

#Роман хочет, чтобы кассиры магазина могли быстро вычислять средний чек.
#Реализуйте программу, которая:

#1. Запрашивает у пользователя три числа.
#2. Вычисляет их среднее арифметическое.
#3. Выводит результат.