x = input("Введите число: ")
int_numer = int(x)
y = int_numer * 2
print(f"Заданное число умноженное на 2 равно: {y}")

#Задача 1: Конвертер типов

#Описание:

#Роман придумал новую акцию, по ней пользователи, которые не умеют заранее преобразовывать цену в число платят в два раза больше!

#Реализуйте программу, которая:

#1. Запрашивает у пользователя строку.

#2. Преобразует эту строку в целое число.

#3. Умножает полученное число на 2.

#4. Выводит результат обратно в формате строки.