def discount_gen(shelves):

    discounts = []

    for i, shelf in enumerate(shelves):
        shelf_discount = []
        for j in range(1, shelf[1] + 1):
            discount = i + 1
            shelf_discount.append(discount * shelf[1])

        discounts.append(shelf_discount)

    return discounts


shelves_1 = [[4, 2], [5, 3], [6, 5]]
shelves_2 = [[3, 1], [4, 4]]

discount_1 = discount_gen(shelves_1)
discount_2 = discount_gen(shelves_2)

print(f"Скидки: {discount_1}")
print(f"Скидки: {discount_2}")

#Задача 3: Роман планирует акции
#Описание:  

#Роман хочет провести акцию и предложить скидки на товары, находящиеся на определенной полке. 
#Напишите программу, которая генерирует двумерный массив, показывающий размер скидки для каждого товара на полке. 
#Скидка для товара на полке равна номеру полки * количество товаров на полке.

#Таблица входных и выходных данных:

#|            Входные данные               |         Выходные данные                           |
#| --------------------------------------- | ----------------------------------                |
#| Полки: [[4, 2], [5, 3], [6, 5]]         | Скидки: [[2, 2], [6, 6, 6], [15, 15, 15, 15, 15]] |
#| Полки: [[3, 1], [4, 4]]                 | Скидки: [[1], [8, 8, 8, 8]]                       |